In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\dave joshua\appdata\local\programs\python\python313\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\dave joshua\appdata\local\programs\python\python313\lib\site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: ipython in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython-sql) (9.0.1)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\dave joshua\appdata\local\programs\python\python313\lib\site-packages (from ipython-sql) (2.0.39)
Requirement already satisfied: sqlparse in c:\users\dave joshua\appdata\local\programs\python\python313\lib\site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in c:\users\dave joshua\appdata\local\programs\python\python313\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dave joshua\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\dave joshua\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: colorama in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython->ipython-sql) (5.2.1)
Requirement already satisfied: ipython-pygments-lexers in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython->ipython-sql) (1.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython->ipython-sql) (3.0.50)
Requirement already satisfied: pygments>=2.4.0 in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in c:\users\dave joshua\appdata\local\programs\python\python313\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from stack_data->ipython->ipython-sql) (2.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure-eval in c:\users\dave joshua\appdata\roaming\python\python313\site-packages (from stack_data->ipython->ipython-sql) (0.2.3)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
import sqlite3

In [12]:
# Load two CSV files into DataFrames
df_menu_items = pd.read_csv('menu_items.csv')  # First CSV file
df_order_details = pd.read_csv('order_details.csv')  # Second CSV file

print(df_menu_items.head())
print(df_order_details.head())

   menu_item_id      item_name  category  price
0           101      Hamburger  American  12.95
1           102   Cheeseburger  American  13.95
2           103        Hot Dog  American   9.00
3           104  Veggie Burger  American  10.50
4           105   Mac & Cheese  American   7.00
   order_details_id  order_id order_date   order_time  item_id
0                 1         1     1/1/23  11:38:36 AM    109.0
1                 2         2     1/1/23  11:57:40 AM    108.0
2                 3         2     1/1/23  11:57:40 AM    124.0
3                 4         2     1/1/23  11:57:40 AM    117.0
4                 5         2     1/1/23  11:57:40 AM    129.0

In [13]:
# Create a connection to a sqlite database (It will create one if it doesn't exist)
conn = sqlite3.connect("example_3.db")

In [14]:
# Load DataFrames into SQL tables
df_menu_items.to_sql('menu_items', conn, if_exists='replace', index=False)
df_order_details.to_sql('order_details', conn, if_exists='replace', index=False)

12234

In [15]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [31]:
 %reload_ext sql

In [21]:
%sql sqlite:///example_3.db

## Combine the menu_items and order_details tables into a single table.

In [30]:
%%sql
SELECT * FROM menu_items LIMIT 10;

SELECT * FROM order_details LIMIT 10;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.
Done.

[(1, 1, '1/1/23', '11:38:36 AM', 109.0),
 (2, 2, '1/1/23', '11:57:40 AM', 108.0),
 (3, 2, '1/1/23', '11:57:40 AM', 124.0),
 (4, 2, '1/1/23', '11:57:40 AM', 117.0),
 (5, 2, '1/1/23', '11:57:40 AM', 129.0),
 (6, 2, '1/1/23', '11:57:40 AM', 106.0),
 (7, 3, '1/1/23', '12:12:28 PM', 117.0),
 (8, 3, '1/1/23', '12:12:28 PM', 119.0),
 (9, 4, '1/1/23', '12:16:31 PM', 117.0),
 (10, 5, '1/1/23', '12:21:30 PM', 117.0)]

In [35]:
%%sql

SELECT *
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id LIMIT 20;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[(1, 1, '1/1/23', '11:38:36 AM', 109.0, 109, 'Korean Beef Bowl', 'Asian', 17.95),
 (2, 2, '1/1/23', '11:57:40 AM', 108.0, 108, 'Tofu Pad Thai', 'Asian', 14.5),
 (3, 2, '1/1/23', '11:57:40 AM', 124.0, 124, 'Spaghetti', 'Italian', 14.5),
 (4, 2, '1/1/23', '11:57:40 AM', 117.0, 117, 'Chicken Burrito', 'Mexican', 12.95),
 (5, 2, '1/1/23', '11:57:40 AM', 129.0, 129, 'Mushroom Ravioli', 'Italian', 15.5),
 (6, 2, '1/1/23', '11:57:40 AM', 106.0, 106, 'French Fries', 'American', 7.0),
 (7, 3, '1/1/23', '12:12:28 PM', 117.0, 117, 'Chicken Burrito', 'Mexican', 12.95),
 (8, 3, '1/1/23', '12:12:28 PM', 119.0, 119, 'Chicken Torta', 'Mexican', 11.95),
 (9, 4, '1/1/23', '12:16:31 PM', 117.0, 117, 'Chicken Burrito', 'Mexican', 12.95),
 (10, 5, '1/1/23', '12:21:30 PM', 117.0, 117, 'Chicken Burrito', 'Mexican', 12.95),
 (11, 6, '1/1/23', '12:29:36 PM', 101.0, 101, 'Hamburger', 'American', 12.95),
 (12, 6, '1/1/23', '12:29:36 PM', 114.0, 114, 'Potstickers', 'Asian', 9.0),
 (13, 7, '1/1/23', '12:50:37 PM', 123.0, 123, 'Chips & Guacamole', 'Mexican', 9.0),
 (14, 8, '1/1/23', '12:51:37 PM', 123.0, 123, 'Chips & Guacamole', 'Mexican', 9.0),
 (15, 9, '1/1/23', '12:52:01 PM', 108.0, 108, 'Tofu Pad Thai', 'Asian', 14.5),
 (16, 9, '1/1/23', '12:52:01 PM', 126.0, 126, 'Fettuccine Alfredo', 'Italian', 14.5),
 (17, 9, '1/1/23', '12:52:01 PM', 110.0, 110, 'Pork Ramen', 'Asian', 17.95),
 (18, 9, '1/1/23', '12:52:01 PM', 117.0, 117, 'Chicken Burrito', 'Mexican', 12.95),
 (19, 9, '1/1/23', '12:52:01 PM', 117.0, 117, 'Chicken Burrito', 'Mexican', 12.95),
 (20, 9, '1/1/23', '12:52:01 PM', 129.0, 129, 'Mushroom Ravioli', 'Italian', 15.5)]

## What were the least and most ordered items? What categories were they in?

In [38]:
%%sql

SELECT item_name, COUNT(order_details_id) as num_purchases
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id
    GROUP BY item_name;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[(None, 137),
 ('California Roll', 355),
 ('Cheese Lasagna', 207),
 ('Cheese Quesadillas', 233),
 ('Cheeseburger', 583),
 ('Chicken Burrito', 455),
 ('Chicken Parmesan', 364),
 ('Chicken Tacos', 123),
 ('Chicken Torta', 379),
 ('Chips & Guacamole', 237),
 ('Chips & Salsa', 461),
 ('Edamame', 620),
 ('Eggplant Parmesan', 420),
 ('Fettuccine Alfredo', 249),
 ('French Fries', 571),
 ('Hamburger', 622),
 ('Hot Dog', 257),
 ('Korean Beef Bowl', 588),
 ('Mac & Cheese', 463),
 ('Meat Lasagna', 273),
 ('Mushroom Ravioli', 359),
 ('Orange Chicken', 456),
 ('Pork Ramen', 360),
 ('Potstickers', 205),
 ('Salmon Roll', 324),
 ('Shrimp Scampi', 239),
 ('Spaghetti', 367),
 ('Spaghetti & Meatballs', 470),
 ('Steak Burrito', 354),
 ('Steak Tacos', 214),
 ('Steak Torta', 489),
 ('Tofu Pad Thai', 562),
 ('Veggie Burger', 238)]

#### Least ordered item on the menu

In [50]:
%%sql

SELECT item_name, category, COUNT(order_details_id) AS num_purchases
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id
    GROUP BY item_name, category
    ORDER BY num_purchases LIMIT 1;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[('Chicken Tacos', 'Mexican', 123)]

#### Most ordered item on the menu

In [49]:
%%sql

SELECT item_name, category, COUNT(order_details_id) AS num_purchases
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id
    GROUP BY item_name, category
    ORDER BY num_purchases DESC LIMIT 1;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[('Hamburger', 'American', 622)]

## Combined output

In [47]:
%%sql
WITH item_counts AS (
    SELECT 
        mi.item_name, 
        mi.category,  -- Include category
        COUNT(od.order_details_id) AS num_purchases
    FROM order_details od
    LEFT JOIN menu_items mi ON od.item_id = mi.menu_item_id
    GROUP BY mi.item_name, mi.category
)

-- Get most and least ordered items
SELECT * FROM item_counts
WHERE num_purchases = (SELECT MAX(num_purchases) FROM item_counts)
   OR num_purchases = (SELECT MIN(num_purchases) FROM item_counts);

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[('Chicken Tacos', 'Mexican', 123), ('Hamburger', 'American', 622)]

## What were the top 5 orders that spent the most money?

In [55]:
%%sql

SELECT order_id, ROUND(SUM(price), 2) AS total_spend
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id 
    GROUP BY order_id
    LIMIT 20;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[(1, 17.95),
 (2, 64.45),
 (3, 24.9),
 (4, 12.95),
 (5, 12.95),
 (6, 21.95),
 (7, 9.0),
 (8, 9.0),
 (9, 132.25),
 (10, 22.5),
 (11, 45.85),
 (12, 51.35),
 (13, 15.5),
 (14, 9.0),
 (15, 50.5),
 (16, 36.9),
 (17, 154.15),
 (18, 11.95),
 (19, 31.9),
 (20, 31.0)]

### These are the Top 5

In [60]:
%%sql

SELECT order_id, item_name, ROUND(SUM(price), 2) AS total_spend
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id 
    GROUP BY order_id
    ORDER BY total_spend DESC LIMIT 5;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[(440, 'Steak Tacos', 192.15),
 (2075, 'Orange Chicken', 191.05),
 (1957, 'Orange Chicken', 190.1),
 (330, 'Orange Chicken', 189.7),
 (2675, 'Hamburger', 185.1)]

Order that has a highest spend has an Order ID **440**.

## View the details of the highest spend order. What insights can you gather from the Data?

In [66]:
%%sql

SELECT *
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id WHERE order_id = 440;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[(1003, 440, '1/8/23', '12:16:34 PM', 116.0, 116, 'Steak Tacos', 'Mexican', 13.95),
 (1004, 440, '1/8/23', '12:16:34 PM', 103.0, 103, 'Hot Dog', 'American', 9.0),
 (1005, 440, '1/8/23', '12:16:34 PM', 124.0, 124, 'Spaghetti', 'Italian', 14.5),
 (1006, 440, '1/8/23', '12:16:34 PM', 125.0, 125, 'Spaghetti & Meatballs', 'Italian', 17.95),
 (1007, 440, '1/8/23', '12:16:34 PM', 125.0, 125, 'Spaghetti & Meatballs', 'Italian', 17.95),
 (1008, 440, '1/8/23', '12:16:34 PM', 126.0, 126, 'Fettuccine Alfredo', 'Italian', 14.5),
 (1009, 440, '1/8/23', '12:16:34 PM', 126.0, 126, 'Fettuccine Alfredo', 'Italian', 14.5),
 (1010, 440, '1/8/23', '12:16:34 PM', 109.0, 109, 'Korean Beef Bowl', 'Asian', 17.95),
 (1011, 440, '1/8/23', '12:16:34 PM', 127.0, 127, 'Meat Lasagna', 'Italian', 17.95),
 (1012, 440, '1/8/23', '12:16:34 PM', 113.0, 113, 'Edamame', 'Asian', 5.0),
 (1013, 440, '1/8/23', '12:16:34 PM', 122.0, 122, 'Chips & Salsa', 'Mexican', 7.0),
 (1014, 440, '1/8/23', '12:16:34 PM', 131.0, 131, 'Chicken Parmesan', 'Italian', 17.95),
 (1015, 440, '1/8/23', '12:16:34 PM', 106.0, 106, 'French Fries', 'American', 7.0),
 (1016, 440, '1/8/23', '12:16:34 PM', 132.0, 132, 'Eggplant Parmesan', 'Italian', 16.95)]

In [67]:
%%sql

SELECT category, COUNT(item_id) AS num_items
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id WHERE order_id = 440
    GROUP BY category;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[('American', 2), ('Asian', 2), ('Italian', 8), ('Mexican', 2)]

### This is from the Top 5

In [68]:
%%sql

SELECT category, COUNT(item_id) AS num_items
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id WHERE order_id IN (440, 2075, 1957, 330, 2675)
    GROUP BY category;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[('American', 10), ('Asian', 17), ('Italian', 26), ('Mexican', 16)]

In [69]:
%%sql

SELECT order_id, category, COUNT(item_id) AS num_items
FROM order_details od LEFT JOIN menu_items mi
    ON od.item_id = mi.menu_item_id 
    WHERE order_id IN (440, 2075, 1957, 330, 2675)
    GROUP BY order_id, category;

   sqlite:///example.db
 * sqlite:///example_3.db
Done.

[(330, 'American', 1),
 (330, 'Asian', 6),
 (330, 'Italian', 3),
 (330, 'Mexican', 4),
 (440, 'American', 2),
 (440, 'Asian', 2),
 (440, 'Italian', 8),
 (440, 'Mexican', 2),
 (1957, 'American', 3),
 (1957, 'Asian', 3),
 (1957, 'Italian', 5),
 (1957, 'Mexican', 3),
 (2075, 'American', 1),
 (2075, 'Asian', 3),
 (2075, 'Italian', 6),
 (2075, 'Mexican', 3),
 (2675, 'American', 3),
 (2675, 'Asian', 3),
 (2675, 'Italian', 4),
 (2675, 'Mexican', 4)]